//给你一个二维整数数组 envelopes ，其中 envelopes[i] = [wi, hi] ，表示第 i 个信封的宽度和高度。 
//
// 当另一个信封的宽度和高度都比这个信封大的时候，这个信封就可以放进另一个信封里，如同俄罗斯套娃一样。 
//
// 请计算 最多能有多少个 信封能组成一组“俄罗斯套娃”信封（即可以把一个信封放到另一个信封里面）。 
//
// 注意：不允许旋转信封。 
//
// 示例 1： 
//
// 
//输入：envelopes = [[5,4],[6,4],[6,7],[2,3]]
//输出：3
//解释：最多信封的个数为 3, 组合为: [2,3] => [5,4] => [6,7]。 
//
// 示例 2： 
//
// 
//输入：envelopes = [[1,1],[1,1],[1,1]]
//输出：1
// 
//
// 
//
// 提示： 
//
// 
// 1 <= envelopes.length <= 10⁵ 
// envelopes[i].length == 2 
// 1 <= wi, hi <= 10⁵ 
// 
//
// Related Topics 数组 二分查找 动态规划 排序 👍 1127 👎 0

namespace RussianDollEnvelopes;

//leetcode submit region begin(Prohibit modification and deletion)
public class Solution
{
    public int MaxEnvelopes(int[][] envelopes)
    {
        // 先按宽度升序排序；当宽度相同时按高度降序排序
        Array.Sort(envelopes, (a, b) => a[0] == b[0] ? b[1] - a[1] : a[0] - b[0]);

        var dp = new List<int>(); // dp[i] 表示长度为 i+1 的递增子序列的末尾元素的高最小值，必定是递增的
        foreach (var env in envelopes) {
            var height = env[1];
            int lo = 0, hi = dp.Count;
            // 找到第一个大于等于 height 的位置
            while (lo < hi) {
                var mid = (lo + hi) / 2;
                if (height <= dp[mid])
                    hi = mid;
                else
                    lo = mid + 1;
            }

            if (lo == dp.Count) // height 比所有元素都大，这说明可以接在最长递增子序列的后面
                dp.Add(height);
            else // 否则更新该位置的元素，使得末尾元素的高更小，增加后续接入元素的可能性
                dp[lo] = height;
        }

        return dp.Count;
    }
}
//leetcode submit region end(Prohibit modification and deletion)
