//编写一个程序，通过填充空格来解决数独问题。 
//
// 数独的解法需 遵循如下规则： 
//
// 
// 数字 1-9 在每一行只能出现一次。 
// 数字 1-9 在每一列只能出现一次。 
// 数字 1-9 在每一个以粗实线分隔的 3x3 宫内只能出现一次。（请参考示例图） 
// 
//
// 数独部分空格内已填入了数字，空白格用 '.' 表示。 
//
// 
//
// 
// 
// 
// 示例 1： 
// 
// 
//输入：board = [["5","3",".",".","7",".",".",".","."],["6",".",".","1","9","5",".
//",".","."],[".","9","8",".",".",".",".","6","."],["8",".",".",".","6",".",".",".
//","3"],["4",".",".","8",".","3",".",".","1"],["7",".",".",".","2",".",".",".","6
//"],[".","6",".",".",".",".","2","8","."],[".",".",".","4","1","9",".",".","5"],[
//".",".",".",".","8",".",".","7","9"]]
//输出：[["5","3","4","6","7","8","9","1","2"],["6","7","2","1","9","5","3","4","8
//"],["1","9","8","3","4","2","5","6","7"],["8","5","9","7","6","1","4","2","3"],[
//"4","2","6","8","5","3","7","9","1"],["7","1","3","9","2","4","8","5","6"],["9",
//"6","1","5","3","7","2","8","4"],["2","8","7","4","1","9","6","3","5"],["3","4",
//"5","2","8","6","1","7","9"]]
//解释：输入的数独如上图所示，唯一有效的解决方案如下所示：
// 
// 
// 
// 
//
//
//
// 
//
// 提示： 
//
// 
// board.length == 9 
// board[i].length == 9 
// board[i][j] 是一位数字或者 '.' 
// 题目数据 保证 输入数独仅有一个解 
// 
//
// Related Topics 数组 哈希表 回溯 矩阵 👍 1927 👎 0

namespace SudokuSolver;

//leetcode submit region begin(Prohibit modification and deletion)
public class Solution
{
    public void SolveSudoku(char[][] board)
    {
        var rows = new int[9];
        var cols = new int[9];
        var boxes = new int[9];

        // 初始化已用数字
        for (var i = 0; i < 9; i++)
            for (var j = 0; j < 9; j++) {
                if (board[i][j] == '.') continue;
                var num = board[i][j] - '0';
                rows[i] |= 1 << num;
                cols[j] |= 1 << num;
                boxes[i / 3 * 3 + j / 3] |= 1 << num;
            }

        Dfs(0);
        return;

        bool Dfs(int pos)
        {
            // 找到下一个空格
            while (pos < 81 && board[pos / 9][pos % 9] != '.') pos++;

            if (pos == 81) return true;

            int i = pos / 9, j = pos % 9;

            for (var n = 1; n <= 9; n++) {
                var mask = 1 << n;
                var boxIndex = i / 3 * 3 + j / 3;
                if ((rows[i] & mask) + (cols[j] & mask) + (boxes[boxIndex] & mask) > 0) continue; // 数字已占用时跳过

                board[i][j] = (char)(n + '0');
                rows[i] |= mask;
                cols[j] |= mask;
                boxes[boxIndex] |= mask;

                if (Dfs(pos + 1)) return true;
                // 回溯
                rows[i] &= ~mask;
                cols[j] &= ~mask;
                boxes[boxIndex] &= ~mask;
                board[i][j] = '.';
            }


            return false;
        }
    }
}
//leetcode submit region end(Prohibit modification and deletion)
